Ran Plan for project: `production-environment` dir: `resume-qliu-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.rg-qliubackend-prod.azurerm_cosmosdb_sql_database.cosmos-sql-db-prod has been deleted
- resource "azurerm_cosmosdb_sql_database" "cosmos-sql-db-prod" {
        id                  = "/subscriptions/b8a4d2eb-79b6-4128-89b7-924413033e68/resourceGroups/rg-qliubackend-prod/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-qliubackend-prod/sqlDatabases/cosmos-sql-db-prod"
-       name                = "cosmos-sql-db-prod" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.rg-qliuapi-prod.azurerm_application_insights.appi-recordvisit-prod will be created
+ resource "azurerm_application_insights" "appi-recordvisit-prod" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "westus2"
+       name                                = "appi-recordvisit-prod"
+       resource_group_name                 = "rg-qliuapi-prod"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.rg-qliuapi-prod.azurerm_application_insights_smart_detection_rule.alert-recordvisit-dosattack-prod will be created
+ resource "azurerm_application_insights_smart_detection_rule" "alert-recordvisit-dosattack-prod" {
+       application_insights_id            = (known after apply)
+       enabled                            = true
+       id                                 = (known after apply)
+       name                               = "Potential security issue detected"
+       send_emails_to_subscription_owners = true
    }

  # module.rg-qliuapi-prod.azurerm_application_insights_smart_detection_rule.alert-recordvisit-failedtorespond-prod will be created
+ resource "azurerm_application_insights_smart_detection_rule" "alert-recordvisit-failedtorespond-prod" {
+       application_insights_id            = (known after apply)
+       enabled                            = true
+       id                                 = (known after apply)
+       name                               = "Slow page load time"
+       send_emails_to_subscription_owners = true
    }

  # module.rg-qliuapi-prod.azurerm_application_insights_smart_detection_rule.alert-recordvisit-highdelayresponse-prod will be created
+ resource "azurerm_application_insights_smart_detection_rule" "alert-recordvisit-highdelayresponse-prod" {
+       application_insights_id            = (known after apply)
+       enabled                            = true
+       id                                 = (known after apply)
+       name                               = "Slow server response time"
+       send_emails_to_subscription_owners = true
    }

  # module.rg-qliuapi-prod.azurerm_linux_function_app.func-recordvisit-prod will be created
+ resource "azurerm_linux_function_app" "func-recordvisit-prod" {
+       app_settings                                   = (known after apply)
+       builtin_logging_enabled                        = true
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Optional"
+       content_share_force_disabled                   = false
+       custom_domain_verification_id                  = (sensitive value)
+       daily_memory_time_quota                        = 0
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       functions_extension_version                    = "~4"
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "westus2"
+       name                                           = "func-recordvisit-prod"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-qliuapi-prod"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       storage_account_access_key                     = (sensitive value)
+       storage_account_name                           = "stqliuapiprod"
+       storage_uses_managed_identity                  = false
+       tags                                           = {
+           "Environment" = "Production"
        }
+       vnet_image_pull_enabled                        = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       site_config {
+           always_on                               = (known after apply)
+           app_scale_limit                         = (known after apply)
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           elastic_instance_minimum                = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           pre_warmed_instance_count               = (known after apply)
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               python_version              = "3.11"
+               use_dotnet_isolated_runtime = false
            }

+           cors {
+               allowed_origins     = [
+                   "https://portal.azure.com",
+                   "https://resume.qliu.ca",
                ]
+               support_credentials = false
            }
        }
    }

  # module.rg-qliuapi-prod.azurerm_log_analytics_workspace.log-recordvisit-prod will be created
+ resource "azurerm_log_analytics_workspace" "log-recordvisit-prod" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = false
+       location                        = "westus2"
+       name                            = "log-recordvisit-prod"
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = "rg-qliuapi-prod"
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = (known after apply)
+       workspace_id                    = (known after apply)
    }

  # module.rg-qliuapi-prod.azurerm_logic_app_action_http.send_slack_prod will be created
+ resource "azurerm_logic_app_action_http" "send_slack_prod" {
+       body         = <<-EOT
            {
              "text": "@{concat(
                '*Alert Rule:* ', triggerBody()?['data']?['essentials']?['alertRule'], '\n',
                '*Severity:* ', triggerBody()?['data']?['essentials']?['severity'], '\n',
                '*Condition:* ', triggerBody()?['data']?['essentials']?['monitorCondition'], '\n',
                '*Metric:* ', triggerBody()?['data']?['alertContext']?['condition']?['allOf'][0]?['metricName'], '\n',
                '*Metric Value:* ', string(triggerBody()?['data']?['alertContext']?['condition']?['allOf'][0]?['metricValue']), '\n',
                '*Resource:* ', triggerBody()?['data']?['essentials']?['alertTargetIDs'][0]
              )}"
            }
        EOT
+       headers      = {
+           "Content-Type" = "application/json"
        }
+       id           = (known after apply)
+       logic_app_id = (known after apply)
+       method       = "POST"
+       name         = "send_to_slack"
+       uri          = (sensitive value)
    }

  # module.rg-qliuapi-prod.azurerm_logic_app_trigger_http_request.trigger-prod will be created
+ resource "azurerm_logic_app_trigger_http_request" "trigger-prod" {
+       callback_url = (known after apply)
+       id           = (known after apply)
+       logic_app_id = (known after apply)
+       name         = "incoming_alert"
+       schema       = <<-EOT
            {
                "type": "object",
                "properties": {
                  "schemaId": { "type": "string" },
                  "data": {
                    "type": "object",
                    "properties": {
                      "essentials": {
                        "type": "object",
                        "properties": {
                          "alertRule": { "type": "string" },
                          "severity": { "type": "string" },
                          "monitorCondition": { "type": "string" },
                          "alertTargetIDs": {
                            "type": "array",
                            "items": { "type": "string" }
                          },
                          "firedDateTime": { "type": "string" },
                          "resolvedDateTime": { "type": "string" },
                          "description": { "type": "string" }
                        }
                      },
                      "alertContext": {
                        "type": "object",
                        "properties": {
                          "condition": {
                            "type": "object",
                            "properties": {
                              "allOf": {
                                "type": "array",
                                "items": {
                                  "type": "object",
                                  "properties": {
                                    "metricName": { "type": "string" },
                                    "threshold": { "type": "string" },
                                    "metricValue": { "type": "number" }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "required": ["schemaId", "data"]
              }
        EOT
    }

  # module.rg-qliuapi-prod.azurerm_logic_app_workflow.logic-workflow-qliu-prod will be created
+ resource "azurerm_logic_app_workflow" "logic-workflow-qliu-prod" {
+       access_endpoint                 = (known after apply)
+       connector_endpoint_ip_addresses = (known after apply)
+       connector_outbound_ip_addresses = (known after apply)
+       enabled                         = true
+       id                              = (known after apply)
+       location                        = "westus2"
+       name                            = "send-slack-notification-prod"
+       resource_group_name             = "rg-qliuapi-prod"
+       workflow_endpoint_ip_addresses  = (known after apply)
+       workflow_outbound_ip_addresses  = (known after apply)
+       workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
+       workflow_version                = "1.0.0.0"
    }

  # module.rg-qliuapi-prod.azurerm_monitor_action_group.ag-qliuapi-prod will be created
+ resource "azurerm_monitor_action_group" "ag-qliuapi-prod" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "global"
+       name                = "ag-qliuapi-prod"
+       resource_group_name = "rg-qliuapi-prod"
+       short_name          = "API Alert"

+       azure_app_push_receiver {
+           email_address = "admin@qliu.com"
+           name          = "pushtoadmin"
        }

+       email_receiver {
+           email_address = "steven@qliu.ca"
+           name          = "admin"
        }

+       webhook_receiver {
+           name                    = "pagerduty"
+           service_uri             = (sensitive value)
+           use_common_alert_schema = true
        }
    }

  # module.rg-qliuapi-prod.azurerm_monitor_action_group.slack_logicapp_ag_prod will be created
+ resource "azurerm_monitor_action_group" "slack_logicapp_ag_prod" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "global"
+       name                = "ag-forward-to-logicapp-prod"
+       resource_group_name = "rg-qliuapi-prod"
+       short_name          = "SlackAG"

+       logic_app_receiver {
+           callback_url            = (known after apply)
+           name                    = "logicapp-slack"
+           resource_id             = (known after apply)
+           use_common_alert_schema = true
        }
    }

  # module.rg-qliuapi-prod.azurerm_monitor_diagnostic_setting.diagsetting-recordvisit-prod will be created
+ resource "azurerm_monitor_diagnostic_setting" "diagsetting-recordvisit-prod" {
+       id                             = (known after apply)
+       log_analytics_destination_type = (known after apply)
+       log_analytics_workspace_id     = (known after apply)
+       name                           = "recordvisit-diag"
+       target_resource_id             = (known after apply)

+       enabled_log {
+           category       = "FunctionAppLogs"
            # (1 unchanged attribute hidden)
        }

+       metric {
+           category = "AllMetrics"
+           enabled  = true
        }
    }

  # module.rg-qliuapi-prod.azurerm_monitor_scheduled_query_rules_alert.ddos_detection_prod will be created
+ resource "azurerm_monitor_scheduled_query_rules_alert" "ddos_detection_prod" {
+       auto_mitigation_enabled = false
+       data_source_id          = (known after apply)
+       description             = "Alert when a single IP sends 20+ requests in 5 seconds"
+       enabled                 = true
+       frequency               = 5
+       id                      = (known after apply)
+       location                = "westus2"
+       name                    = "ddos-detection-alert-prod"
+       query                   = <<-EOT
            requests
            | where timestamp > ago(1m)
            | summarize requestCount = count() by client_IP
            | where requestCount >= 20
        EOT
+       query_type              = "ResultCount"
+       resource_group_name     = "rg-qliuapi-prod"
+       severity                = 1
+       tags                    = {
+           "environment" = "production"
+           "type"        = "ddos-monitoring"
        }
+       time_window             = 5

+       action {
+           action_group           = (known after apply)
+           custom_webhook_payload = jsonencode(
                {
+                   alertType = "BurstTraffic"
+                   message   = "20+ requests in 5s from one IP"
                }
            )
+           email_subject          = "DDoS Detection Alert"
        }

+       trigger {
+           operator  = "GreaterThan"
+           threshold = 0
        }
    }

  # module.rg-qliuapi-prod.azurerm_resource_group.rg-qliuapi-prod will be created
+ resource "azurerm_resource_group" "rg-qliuapi-prod" {
+       id       = (known after apply)
+       location = "westus2"
+       name     = "rg-qliuapi-prod"
+       tags     = {
+           "Description" = "Resource group for api resume.qliu.ca"
+           "Environment" = "Production"
        }
    }

  # module.rg-qliuapi-prod.azurerm_service_plan.asp-qliuapi-prod will be created
+ resource "azurerm_service_plan" "asp-qliuapi-prod" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "westus2"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "asp-qliuapi-prod"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "rg-qliuapi-prod"
+       sku_name                     = "Y1"
+       worker_count                 = (known after apply)
    }

  # module.rg-qliuapi-prod.azurerm_storage_account.stqliuapiprod will be created
+ resource "azurerm_storage_account" "stqliuapiprod" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "westus2"
+       min_tls_version                    = "TLS1_2"
+       name                               = "stqliuapiprod"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "Service"
+       resource_group_name                = "rg-qliuapi-prod"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "Service"
+       tags                               = {
+           "environment" = "Production"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)
    }

  # module.rg-qliuapi-prod.azurerm_user_assigned_identity.usi-githubaction-prod will be created
+ resource "azurerm_user_assigned_identity" "usi-githubaction-prod" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "westus2"
+       name                = "usi-githubaction-prod"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-qliuapi-prod"
+       tenant_id           = (known after apply)
    }

  # module.rg-qliubackend-prod.azurerm_cosmosdb_sql_container.cosmos-sql-container-prod will be created
+ resource "azurerm_cosmosdb_sql_container" "cosmos-sql-container-prod" {
+       account_name          = "cosmos-qliubackend-prod"
+       database_name         = "cosmos-sql-db-prod"
+       id                    = (known after apply)
+       name                  = "cosmos-sql-container-prod"
+       partition_key_kind    = "Hash"
+       partition_key_paths   = [
+           "/id",
        ]
+       partition_key_version = 1
+       resource_group_name   = "rg-qliubackend-prod"
+       throughput            = 400

+       conflict_resolution_policy (known after apply)

+       indexing_policy (known after apply)
    }

  # module.rg-qliubackend-prod.azurerm_cosmosdb_sql_database.cosmos-sql-db-prod will be created
+ resource "azurerm_cosmosdb_sql_database" "cosmos-sql-db-prod" {
+       account_name        = "cosmos-qliubackend-prod"
+       id                  = (known after apply)
+       name                = "cosmos-sql-db-prod"
+       resource_group_name = "rg-qliubackend-prod"
+       throughput          = 400
    }

Plan: 19 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production-environment
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://957e114ea4dd:4141/lock?id=qingfengliu0%252FAzureIaC%252Fresume-qliu-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production-environment
  ```

**Note: Objects have changed outside of Terraform**
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```